___
# Data Manipulation: Basics

## Counting and removing blank values
___

### Importing libraries and Classes

In [2]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [3]:
in_blank = np.nan
np.random.seed(21)
df = DataFrame(np.random.rand(36).reshape((6,6)))
df.loc[3:5, 0] = in_blank
df.loc[1:4, 5] = in_blank
df

          0         1         2         3         4         5
0  0.048725  0.289110  0.720966  0.021616  0.205923  0.050773
1  0.302272  0.663910  0.308114  0.583591  0.069571       NaN
2  0.133241  0.178125  0.495930  0.863700  0.758944       NaN
3       NaN  0.384250  0.408718  0.713360  0.270670       NaN
4       NaN  0.760756  0.516669  0.167836  0.298692       NaN
5       NaN  0.460140  0.544368  0.217401  0.799868  0.726684

#### Counting blank values
 object_name.isnull().sum()

In [5]:
df.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

### Removing blank values
object_name.dropna()

In [6]:
df.dropna()

          0        1         2         3         4         5
0  0.048725  0.28911  0.720966  0.021616  0.205923  0.050773

In [7]:
df.dropna(axis=1)

          1         2         3         4
0  0.289110  0.720966  0.021616  0.205923
1  0.663910  0.308114  0.583591  0.069571
2  0.178125  0.495930  0.863700  0.758944
3  0.384250  0.408718  0.713360  0.270670
4  0.760756  0.516669  0.167836  0.298692
5  0.460140  0.544368  0.217401  0.799868